print( 'Шляпка гриба, покрытая ... кожиц..й, держится на ... ножк.. . Снизу шляпка затянута ... . Когда её уберёшь, откроется нижняя ... сторона шляпк.. . ')
a = input('Введите первое недостающее слово: покрытая ... ')

b = input('Введите первую недостающую букву: кожиц..й')

c = input('Введите второе недостающее слово: держится на ... ')

d = input('Введите вторую недостающую букву: на ножк.. ')

e = input('Введите третье недостающее слово: затянута ... ')

f = input('Введите четвёртое недостающее слово: нижняя ...  ')

g = input('Введите третью недостающую букву: шляпк.. ')

print(f'Шляпка гриба, покрытая {a} кожиц{b}, держится на {c} ножк{d}. Снизу шляпка затянута {e}. Когда её уберёшь, откроется нижняя {f} сторона шляпк{g}.')